> thanks @simpson-ross 🙇 that helps clarify things here.
> 
> > TF version 1.1.4 and prior exhibit this error
> 
> this is expected since terraform < 1.1.5 had an issue ([hashicorp/terraform#30330](https://github.com/hashicorp/terraform/pull/30330)) which incorrectly marked fields as `nullable=false`. it was already addressed in 1.2.x but this fix was backported to 1.1.5 if you must run the 1.x release series.
> 
> ```
> $ ASDF_TERRAFORM_VERSION=1.1.4 terraform apply
> ╷
> │ Error: Provider produced invalid plan
> │ 
> │ Provider "registry.terraform.io/cloudflare/cloudflare" planned an invalid value for cloudflare_record.mx_1.allow_overwrite: planned value cty.False for a non-computed attribute.
> │ 
> │ This is a bug in the provider, which should be reported in the provider's own issue tracker.
> ╵
> ```
> 
> ```
> $ ASDF_TERRAFORM_VERSION=1.1.5 terraform apply
> 
> Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
>   + create
> 
> Terraform will perform the following actions:
> 
>   # cloudflare_record.mx_1 will be created
>   + resource "cloudflare_record" "mx_1" {
>       + allow_overwrite = false
>       + created_on      = (known after apply)
>       + hostname        = (known after apply)
>       + id              = (known after apply)
>       + metadata        = (known after apply)
>       + modified_on     = (known after apply)
>       + name            = "@"
>       + priority        = 5
>       + proxiable       = (known after apply)
>       + ttl             = 300
>       + type            = "MX"
>       + value           = "route1.mx.cloudflare.net"
>       + zone_id         = "0da42c8d2132a9ddaf714f9e7c920711"
>     }
> 
> Plan: 1 to add, 0 to change, 0 to destroy.
> 
> Do you want to perform these actions?
>   Terraform will perform the actions described above.
>   Only 'yes' will be accepted to approve.
> 
>   Enter a value: yes
> 
> cloudflare_record.mx_1: Creating...
> cloudflare_record.mx_1: Creation complete after 0s [id=318a0b16eea91338ef42a36ef8d51adc]
> ```
> 
> do you see this behaviour with terraform > 1.2 and the 4.x release of the provider?

Can confirm after testing many different Terraform versions last week I found that Terraform versions >= 1.1.5 didn't exhibit this bug - nice to know for sure it was a Terraform bug, cheers!